{
  "architectures": [
    "DeepseekV3ForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "auto_map": {
    "AutoConfig": "configuration_deepseek.DeepseekV3Config",
    "AutoModel": "modeling_deepseek.DeepseekV3Model",
    "AutoModelForCausalLM": "modeling_deepseek.DeepseekV3ForCausalLM"
  },
  "bos_token_id": 0,
  "eos_token_id": 1,
  "ep_size": 1,
  "first_k_dense_replace": 1,
  "hidden_act": "silu",
  "hidden_size": 768,
  "initializer_range": 0.02,
  "intermediate_size": 2048,
  "kv_lora_rank": 128,
  "max_position_embeddings": 2048,
  "model_type": "deepseek_v3",
  "moe_intermediate_size": 384,
  "moe_layer_freq": 2,
  "n_group": 4,
  "n_routed_experts": 8,
  "n_shared_experts": 1,
  "norm_topk_prob": true,
  "num_attention_heads": 12,
  "num_experts_per_tok": 2,
  "num_hidden_layers": 12,
  "num_key_value_heads": 12,
  "q_lora_rank": 256,
  "qk_nope_head_dim": 32,
  "qk_rope_head_dim": 32,
  "quantization_config": {
    "activation_scheme": "dynamic",
    "fmt": "e4m3",
    "quant_method": "fp8",
    "weight_block_size": [
      128,
      128
    ]
  },
  "rms_norm_eps": 1e-06,
  "rope_scaling": {
    "beta_fast": 32,
    "beta_slow": 1,
    "factor": 40,
    "mscale": 1.0,
    "mscale_all_dim": 1.0,
    "original_max_position_embeddings": 512,
    "type": "yarn"
  },
  "rope_theta": 10000,
  "routed_scaling_factor": 2.5,
  "scoring_func": "sigmoid",
  "tie_word_embeddings": false,
  "topk_group": 2,
  "topk_method": "noaux_tc",
  "torch_dtype": "bfloat16",
  "transformers_version": "4.33.1",
  "use_cache": true,
  "v_head_dim": 32,
  "vocab_size": 129280,
  "_name_or_path": "deepseek-ai/DeepSeek-V3-Tiny"
}
